<?php
namespace App\Conf;
!defined('GREATANTS') && exit('Access Denied');

class Config_Status
{
    public static $_status = [
        200 => '请求成功',
        403 => '权限不足',
        404 => '404 NOT FOUND',
        700 => '数据为空',
        701 => '未知错误',
        702 => '请求参数不合法',
        703 => '不合规的返回值',
        704 => '非法的文件类型',
        800 => '数据库操作失败',
        801 => '缓存操作失败',
        803 => '消息队列操作失败',
        805 => '文件不存在',
        804 => '文件操作失败',
        901 => '用户不存在',
        902 => '密码错误',
        903 => 'Token无效',
        904 => 'JSON解析出错',
        905 => 'base4解析出错',
        905 => '验证码错误',
        906 => '尚未被扫码'
    ];
}