<?php

namespace App\Conf;
!defined('GREATANTS') && exit('Access Denied');

class Config_Reason
{
    public static $_reason = [
        11  => '牌局结算',
        12  => '台费',
        51  => '系统消息奖励',
        
        100 => '初始金币',
        101 => '第一破产补助',
        102 => '第二破产补助',
        103 => '更多破产补助',
        104 => '打牌活动',
        119 => '每日签到',
        120 => '邀请奖励',
        121 => '好友列表召回奖励',
        122 => '使用道具',
        123 => '离线召回奖励',
        124 => '邀请成功奖励',
        125 => '好友回归奖励',
        126 => 'messenger答题',
        127 => 'messenger回归奖励',
        128 => '添加快捷方式到主屏幕奖励',
        129 => '观看视频广告奖励',
        130 => '观看视频签到奖励',
        131 => '结算分享奖励',
        205 => 'Google支付',
        //PHP 后台
        300 => '金币功能测试',
        301 => '金币丢失，补偿',
        302 => '金币用户鼓励',
        303 => '金币活动奖励手动发放',
        304 => '金币支付成功未发货时补发',
        305 => '金币异常账号扣除'
    ];
}
